he
lee
?
doctor
what
number
know
you guys
teacher
ask
you
call
too
today
please
ask
us
she
not
me
few
is
您
family
moon
empty
knife
vegetable
single
piece
六
new
double
wrong
hospital
rhetoric question
noon
name
relation (gated mountain pass)
customer service rep
meaning
bell
colour
help
thanks
enter
learn
aid
pork meat
exercise
一下
lots
finish
black
who
run
Cheung
metro
busy
which
toilet
down
empty
relationship
split
cup
pants
exit
go
meaning
hope
listen
face(written)
point
eat
again
against
sickness
spain
allow
booking
drink(written)
him plural
nose
camera
apple
wrong
bright
tomorrow
taiwan
tray
plate
thing
come
beer
body
korea
finish
at
please
small
period of time
step
watermelon
think
can achieve
slap
shine
uncooked rice
want
china
so
book
seat
newspaper
noodle
collective noun long
this year
ship
cake
三
ten thousand
a few
age
talent/only
road
thousand
go
photo(written)
photo(spoken)
九
shoe
feed
at side
chocolate
word
father
tummy
bird(written)
bird(spoken)
feels like
wine
event
door
fork
fat
can
day of week
this
inside
spoon
slow
yet
dress
fever
short
kick
zero
office
drink(spoken)
輛 ?
swim
know/recognise
return
inform(written)
commercial shop
she plural
after school
through/cross
new york
mouth
table(written)
table(spoken)
health
evening
italy
chicken meat
head
sky
expense
doing right now
now(written)
now(spoken)
only
use
dance
sit(written)
arrive
please
find
hour
run
gas car
love
family
chicken egg
public use
husband
hotel
england
evening
sorry
at
need
can
play
vegetables
hand
full
on the right
game
male
flu
quality
see
because
birthday
difficult
swimming
's
car
rice cooked
appearance
go
包
出租車
毛
沒
收
隨便
它
少
不客氣
昨天
新鮮
信用卡
香蕉
每
便宜
妻子
上班
舒服
甜點
後面
綠
塊
椅子
上網
往
站
會
請
日本
喜歡
熱
好看
家人
兩
明年
弟弟
貓
新聞
晚飯
張
給
快
午飯
英語
牛肉
週末
都
比
太
工作
一
日
時間
上午
跑步
瓶子
好喝
八
讀
外
真
狗
德國
頭髮
味道
歌
條
再見
旅遊
中文
倫敦
做
疼
國
最近
為什麼
有點兒
漢語
碗
那裡
早
天
見
元
藍
吃
樹
大
大家
加拿大
刻
早上
累
兒子
開始
了
腳
電話
高
件
北京
果汁
電腦
明星
電視
位
肉
前面
飯館
王
半
一共
麵包
開
西班牙
百
整
英文
跟
音樂
衣服
籃球
渴
事情
好久不見
買單
一點兒
起床
美國
人
下班
和
應該
買
明白
錢
幹
遊
怎麼
朋友
筷子
鍛煉
打扮
咖啡
左邊
非常
這
騎
華
做
手機
本
現在
下
茶
妹妹
足球
早安
下午
說
一起
現金
見
等
藥
糖
吧
學生
試
房間
孩子
米飯
體育
姐姐
很
餓
輕鬆
一點兒
歡迎
襯衫
秒
牛奶
杯
姓
冰箱
晚安
分鐘
高興
五
上海
羊肉
魚
袋
浪漫
水果
印度
打
女兒
睡覺
寫
四
號碼
住
眼睛
那
水
會
從
再
可愛
多少
上
香港
貴
派對
一會兒
這兒
媽媽
請假
漂亮
面
二
約會
冰
次
休息
超市
飯
女
給
好
學校
別
注意
還
十
唱
下
耳朵
馬
已經
愛好
七
留
一定
年
去年
有
最
電影
差
哥哥